nodeflight/nodeflight-fw/src/platform/stm32f7xx/stm32f746/hwmap_stm32f746.c
PP_INST_DECL(timer, tim8_ch1, TIMER_DEF(8, 1, TIM8_UP_TIM13_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_a05, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_a07, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_c06, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_h13, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_i05, 0x0003),
    // PP_INST_RS(TIMER_ARG_DMA, dma_2_2, 0),
    PP_INST_RS(TIMER_ARG_DMA, dma_2_2, 7),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
PP_INST_DECL(timer, tim8_ch2, TIMER_DEF(8, 2, TIM8_UP_TIM13_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_b00, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_b14, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_c07, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_h14, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_i06, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_2_2, 0),
    PP_INST_RS(TIMER_ARG_DMA, dma_2_3, 7),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
PP_INST_DECL(timer, tim8_ch3, TIMER_DEF(8, 3, TIM8_UP_TIM13_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_b01, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_b15, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_c08, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_h15, 0x0103),
    PP_INST_RS(TIMER_ARG_PIN, pin_i07, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_2_2, 0),
    PP_INST_RS(TIMER_ARG_DMA, dma_2_4, 7),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
PP_INST_DECL(timer, tim8_ch4, TIMER_DEF(8, 4, TIM8_UP_TIM13_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_c09, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_i02, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_2_7, 7),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);

PP_INST_DECL(timer, tim9_ch1, TIMER_DEF(9, 1, TIM1_BRK_TIM9_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_a02, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_e05, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
PP_INST_DECL(timer, tim9_ch2, TIMER_DEF(9, 2, TIM1_BRK_TIM9_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_a03, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_e06, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
// PP_INST_DECL(timer, tim9_ch3, TIMER_DEF(9, 3, TIM1_BRK_TIM9_IRQn),
// );
// PP_INST_DECL(timer, tim9_ch4, TIMER_DEF(9, 4, TIM1_BRK_TIM9_IRQn),
// );

PP_INST_DECL(timer, tim10_ch1, TIMER_DEF(10, 1, TIM1_UP_TIM10_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_b08, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_f06, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
// PP_INST_DECL(timer, tim10_ch2, TIMER_DEF(10, 2, TIM1_UP_TIM10_IRQn),
// );
// PP_INST_DECL(timer, tim10_ch3, TIMER_DEF(10, 3, TIM1_UP_TIM10_IRQn),
// );
// PP_INST_DECL(timer, tim10_ch4, TIMER_DEF(10, 4, TIM1_UP_TIM10_IRQn),
// );

PP_INST_DECL(timer, tim11_ch1, TIMER_DEF(11, 1, TIM1_TRG_COM_TIM11_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_b09, 0x0003),
    PP_INST_RS(TIMER_ARG_PIN, pin_f07, 0x0003),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
// PP_INST_DECL(timer, tim11_ch2, TIMER_DEF(11, 2, TIM1_TRG_COM_TIM11_IRQn),
// );
// PP_INST_DECL(timer, tim11_ch3, TIMER_DEF(11, 3, TIM1_TRG_COM_TIM11_IRQn),
// );
// PP_INST_DECL(timer, tim11_ch4, TIMER_DEF(11, 4, TIM1_TRG_COM_TIM11_IRQn),
// );

PP_INST_DECL(timer, tim12_ch1, TIMER_DEF(12, 1, TIM8_BRK_TIM12_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_b14, 0x0009),
    PP_INST_RS(TIMER_ARG_PIN, pin_h06, 0x0009),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
PP_INST_DECL(timer, tim12_ch2, TIMER_DEF(12, 2, TIM8_BRK_TIM12_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_b15, 0x0009),
    PP_INST_RS(TIMER_ARG_PIN, pin_h09, 0x0009),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
// PP_INST_DECL(timer, tim12_ch3, TIMER_DEF(12, 3, TIM8_BRK_TIM12_IRQn),
// );
// PP_INST_DECL(timer, tim12_ch4, TIMER_DEF(12, 4, TIM8_BRK_TIM12_IRQn),
// );

PP_INST_DECL(timer, tim13_ch1, TIMER_DEF(13, 1, TIM8_UP_TIM13_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_a06, 0x0009),
    PP_INST_RS(TIMER_ARG_PIN, pin_f08, 0x0009),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
// PP_INST_DECL(timer, tim13_ch2, TIMER_DEF(13, 2, TIM8_UP_TIM13_IRQn),
// );
// PP_INST_DECL(timer, tim13_ch3, TIMER_DEF(13, 3, TIM8_UP_TIM13_IRQn),
// );
// PP_INST_DECL(timer, tim13_ch4, TIMER_DEF(13, 4, TIM8_UP_TIM13_IRQn),
// );

PP_INST_DECL(timer, tim14_ch1, TIMER_DEF(14, 1, TIM8_TRG_COM_TIM14_IRQn),
    PP_INST_RS(TIMER_ARG_PIN, pin_none, 0),
    PP_INST_RS(TIMER_ARG_PIN, pin_a07, 0x0009),
    PP_INST_RS(TIMER_ARG_PIN, pin_f09, 0x0009),
    PP_INST_RS(TIMER_ARG_DMA, dma_none, 0)
);
// PP_INST_DECL(timer, tim14_ch2, TIMER_DEF(14, 2, TIM8_TRG_COM_TIM14_IRQn),
// );
// PP_INST_DECL(timer, tim14_ch3, TIMER_DEF(14, 3, TIM8_TRG_COM_TIM14_IRQn),
// );
// PP_INST_DECL(timer, tim14_ch4, TIMER_DEF(14, 4, TIM8_TRG_COM_TIM14_IRQn),
// );

PP_INST_DECL(spi, spi1, SPI_DEF(1),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_a05, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_b03, 5),

    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_a07, 5),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_b05, 5),

    PP_INST_RS(SPI_ARG_PIN_MISO, pin_a06, 5),
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_b04, 5),

    PP_INST_RS(SPI_ARG_DMA_TX, dma_2_3, 3),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_2_5, 3),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_none, 0),

    PP_INST_RS(SPI_ARG_DMA_RX, dma_2_0, 3),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_2_2, 3),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_none, 0)
);

PP_INST_DECL(spi, spi2, SPI_DEF(2),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_a09, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_b10, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_b13, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_d03, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_i01, 5),

    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_b15, 5),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_c01, 5),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_c03, 5),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_i03, 5),

    PP_INST_RS(SPI_ARG_PIN_MISO, pin_b14, 5),
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_c02, 5),
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_i02, 5),

    PP_INST_RS(SPI_ARG_DMA_TX, dma_1_4, 0),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_none, 0),

    PP_INST_RS(SPI_ARG_DMA_RX, dma_1_3, 0),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_none, 0)
);

PP_INST_DECL(spi, spi3, SPI_DEF(3),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_b03, 6),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_c10, 6),

    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_b05, 6),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_b02, 7),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_c12, 6),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_d06, 5),

