nodeflight/nodeflight-fw/src/platform/stm32f7xx/stm32f746/hwmap_stm32f746.c
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_b04, 6),
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_c11, 6),

    PP_INST_RS(SPI_ARG_DMA_TX, dma_1_5, 0),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_1_7, 0),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_none, 0),

    PP_INST_RS(SPI_ARG_DMA_RX, dma_1_0, 0),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_1_2, 0),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_none, 0)
);

PP_INST_DECL(spi, spi4, SPI_DEF(4),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_e02, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_e12, 5),

    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_e06, 5),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_e14, 5),

    PP_INST_RS(SPI_ARG_PIN_MISO, pin_e05, 5),
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_e13, 5),

    PP_INST_RS(SPI_ARG_DMA_TX, dma_2_1, 4),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_2_4, 5),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_none, 0),

    PP_INST_RS(SPI_ARG_DMA_RX, dma_2_0, 4),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_2_3, 5),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_none, 0)
);

PP_INST_DECL(spi, spi5, SPI_DEF(5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_f07, 5),
    PP_INST_RS(SPI_ARG_PIN_SCK, pin_h06, 5),

    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_f09, 5),
    PP_INST_RS(SPI_ARG_PIN_MOSI, pin_f11, 5),

    PP_INST_RS(SPI_ARG_PIN_MISO, pin_f08, 5),
    PP_INST_RS(SPI_ARG_PIN_MISO, pin_h07, 5),

    PP_INST_RS(SPI_ARG_DMA_TX, dma_2_4, 2),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_2_6, 7),
    PP_INST_RS(SPI_ARG_DMA_TX, dma_none, 0),

    PP_INST_RS(SPI_ARG_DMA_RX, dma_2_3, 2),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_2_5, 7),
    PP_INST_RS(SPI_ARG_DMA_RX, dma_none, 0)
);
